MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKE06Z64VQH4/mcu.h
/*! @name RSIDR1 - Receive Standard Identifier Register 1 */
/*! @{ */
#define MSCAN_RSIDR1_RSIDE_MASK                  (0x8U)
#define MSCAN_RSIDR1_RSIDE_SHIFT                 (3U)
/*! RSIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_RSIDR1_RSIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR1_RSIDE_SHIFT)) & MSCAN_RSIDR1_RSIDE_MASK)
#define MSCAN_RSIDR1_RSRTR_MASK                  (0x10U)
#define MSCAN_RSIDR1_RSRTR_SHIFT                 (4U)
/*! RSRTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_RSIDR1_RSRTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR1_RSRTR_SHIFT)) & MSCAN_RSIDR1_RSRTR_MASK)
#define MSCAN_RSIDR1_RSID2_RSID0_MASK            (0xE0U)
#define MSCAN_RSIDR1_RSID2_RSID0_SHIFT           (5U)
#define MSCAN_RSIDR1_RSID2_RSID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR1_RSID2_RSID0_SHIFT)) & MSCAN_RSIDR1_RSID2_RSID0_MASK)
/*! @} */

/*! @name REIDR2 - Receive Extended Identifier Register 2 */
/*! @{ */
#define MSCAN_REIDR2_REID14_REID7_MASK           (0xFFU)
#define MSCAN_REIDR2_REID14_REID7_SHIFT          (0U)
#define MSCAN_REIDR2_REID14_REID7(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR2_REID14_REID7_SHIFT)) & MSCAN_REIDR2_REID14_REID7_MASK)
/*! @} */

/*! @name REIDR3 - Receive Extended Identifier Register 3 */
/*! @{ */
#define MSCAN_REIDR3_RERTR_MASK                  (0x1U)
#define MSCAN_REIDR3_RERTR_SHIFT                 (0U)
/*! RERTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_REIDR3_RERTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR3_RERTR_SHIFT)) & MSCAN_REIDR3_RERTR_MASK)
#define MSCAN_REIDR3_REID6_REID0_MASK            (0xFEU)
#define MSCAN_REIDR3_REID6_REID0_SHIFT           (1U)
#define MSCAN_REIDR3_REID6_REID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR3_REID6_REID0_SHIFT)) & MSCAN_REIDR3_REID6_REID0_MASK)
/*! @} */

/*! @name REDSR - Receive Extended Data Segment Register N */
/*! @{ */
#define MSCAN_REDSR_RDB_MASK                     (0xFFU)
#define MSCAN_REDSR_RDB_SHIFT                    (0U)
#define MSCAN_REDSR_RDB(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_REDSR_RDB_SHIFT)) & MSCAN_REDSR_RDB_MASK)
/*! @} */

/* The count of MSCAN_REDSR */
#define MSCAN_REDSR_COUNT                        (8U)

/*! @name RDLR - Receive Data Length Register */
/*! @{ */
#define MSCAN_RDLR_RDLC_MASK                     (0xFU)
#define MSCAN_RDLR_RDLC_SHIFT                    (0U)
/*! RDLC - Data Length Code Bits
 *  0b0000..0
 *  0b0001..1
 *  0b0010..2
 *  0b0011..3
 *  0b0100..4
 *  0b0101..5
 *  0b0110..6
 *  0b0111..7
 *  0b1000..8
 */
#define MSCAN_RDLR_RDLC(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_RDLR_RDLC_SHIFT)) & MSCAN_RDLR_RDLC_MASK)
/*! @} */

/*! @name RTSRH - Receive Time Stamp Register High */
/*! @{ */
#define MSCAN_RTSRH_RTS_MASK                     (0xFFU)
#define MSCAN_RTSRH_RTS_SHIFT                    (0U)
#define MSCAN_RTSRH_RTS(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_RTSRH_RTS_SHIFT)) & MSCAN_RTSRH_RTS_MASK)
/*! @} */

/*! @name RTSRL - Receive Time Stamp Register Low */
/*! @{ */
#define MSCAN_RTSRL_RTS_MASK                     (0xFFU)
#define MSCAN_RTSRL_RTS_SHIFT                    (0U)
#define MSCAN_RTSRL_RTS(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_RTSRL_RTS_SHIFT)) & MSCAN_RTSRL_RTS_MASK)
/*! @} */

/*! @name TEIDR0 - Transmit Extended Identifier Register 0 */
/*! @{ */
#define MSCAN_TEIDR0_TEID28_TEID21_MASK          (0xFFU)
#define MSCAN_TEIDR0_TEID28_TEID21_SHIFT         (0U)
#define MSCAN_TEIDR0_TEID28_TEID21(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR0_TEID28_TEID21_SHIFT)) & MSCAN_TEIDR0_TEID28_TEID21_MASK)
/*! @} */

/*! @name TSIDR0 - Transmit Standard Identifier Register 0 */
/*! @{ */
#define MSCAN_TSIDR0_TSID10_TSID3_MASK           (0xFFU)
#define MSCAN_TSIDR0_TSID10_TSID3_SHIFT          (0U)
#define MSCAN_TSIDR0_TSID10_TSID3(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR0_TSID10_TSID3_SHIFT)) & MSCAN_TSIDR0_TSID10_TSID3_MASK)
/*! @} */

/*! @name TEIDR1 - Transmit Extended Identifier Register 1 */
/*! @{ */
#define MSCAN_TEIDR1_TEID17_TEID15_MASK          (0x7U)
#define MSCAN_TEIDR1_TEID17_TEID15_SHIFT         (0U)
#define MSCAN_TEIDR1_TEID17_TEID15(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TEID17_TEID15_SHIFT)) & MSCAN_TEIDR1_TEID17_TEID15_MASK)
#define MSCAN_TEIDR1_TEIDE_MASK                  (0x8U)
#define MSCAN_TEIDR1_TEIDE_SHIFT                 (3U)
/*! TEIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_TEIDR1_TEIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TEIDE_SHIFT)) & MSCAN_TEIDR1_TEIDE_MASK)
#define MSCAN_TEIDR1_TSRR_MASK                   (0x10U)
#define MSCAN_TEIDR1_TSRR_SHIFT                  (4U)
#define MSCAN_TEIDR1_TSRR(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TSRR_SHIFT)) & MSCAN_TEIDR1_TSRR_MASK)
#define MSCAN_TEIDR1_TEID20_TEID18_MASK          (0xE0U)
#define MSCAN_TEIDR1_TEID20_TEID18_SHIFT         (5U)
#define MSCAN_TEIDR1_TEID20_TEID18(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TEID20_TEID18_SHIFT)) & MSCAN_TEIDR1_TEID20_TEID18_MASK)
/*! @} */

/*! @name TSIDR1 - Transmit Standard Identifier Register 1 */
/*! @{ */
#define MSCAN_TSIDR1_TSIDE_MASK                  (0x8U)
#define MSCAN_TSIDR1_TSIDE_SHIFT                 (3U)
/*! TSIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_TSIDR1_TSIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR1_TSIDE_SHIFT)) & MSCAN_TSIDR1_TSIDE_MASK)
#define MSCAN_TSIDR1_TSRTR_MASK                  (0x10U)
#define MSCAN_TSIDR1_TSRTR_SHIFT                 (4U)
/*! TSRTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_TSIDR1_TSRTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR1_TSRTR_SHIFT)) & MSCAN_TSIDR1_TSRTR_MASK)
#define MSCAN_TSIDR1_TSID2_TSID0_MASK            (0xE0U)
#define MSCAN_TSIDR1_TSID2_TSID0_SHIFT           (5U)
#define MSCAN_TSIDR1_TSID2_TSID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR1_TSID2_TSID0_SHIFT)) & MSCAN_TSIDR1_TSID2_TSID0_MASK)
/*! @} */

/*! @name TEIDR2 - Transmit Extended Identifier Register 2 */
/*! @{ */
#define MSCAN_TEIDR2_TEID14_TEID7_MASK           (0xFFU)
#define MSCAN_TEIDR2_TEID14_TEID7_SHIFT          (0U)
#define MSCAN_TEIDR2_TEID14_TEID7(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR2_TEID14_TEID7_SHIFT)) & MSCAN_TEIDR2_TEID14_TEID7_MASK)
/*! @} */

/*! @name TEIDR3 - Transmit Extended Identifier Register 3 */
/*! @{ */
#define MSCAN_TEIDR3_TERTR_MASK                  (0x1U)
#define MSCAN_TEIDR3_TERTR_SHIFT                 (0U)
/*! TERTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_TEIDR3_TERTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR3_TERTR_SHIFT)) & MSCAN_TEIDR3_TERTR_MASK)
#define MSCAN_TEIDR3_TEID6_TEID0_MASK            (0xFEU)
#define MSCAN_TEIDR3_TEID6_TEID0_SHIFT           (1U)
#define MSCAN_TEIDR3_TEID6_TEID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR3_TEID6_TEID0_SHIFT)) & MSCAN_TEIDR3_TEID6_TEID0_MASK)
/*! @} */

