MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKE06Z64VQH4/mcu.h
/** PORT - Register Layout Typedef */
typedef struct {
  __IO uint32_t IOFLT0;                            /**< Port Filter Register 0, offset: 0x0 */
  __IO uint32_t IOFLT1;                            /**< Port Filter Register 1, offset: 0x4 */
  __IO uint32_t PUE0;                              /**< Port Pullup Enable Register 0, offset: 0x8 */
  __IO uint32_t PUE1;                              /**< Port Pullup Enable Register 1, offset: 0xC */
  __IO uint32_t PUE2;                              /**< Port Pullup Enable Register 2, offset: 0x10 */
  __IO uint32_t HDRVE;                             /**< Port High Drive Enable Register, offset: 0x14 */
} PORT_Type;

/* ----------------------------------------------------------------------------
   -- PORT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PORT_Register_Masks PORT Register Masks
 * @{
 */

/*! @name IOFLT0 - Port Filter Register 0 */
/*! @{ */
#define PORT_IOFLT0_FLTA_MASK                    (0x3U)
#define PORT_IOFLT0_FLTA_SHIFT                   (0U)
/*! FLTA - Filter Selection for Input from PTA
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTA(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTA_SHIFT)) & PORT_IOFLT0_FLTA_MASK)
#define PORT_IOFLT0_FLTB_MASK                    (0xCU)
#define PORT_IOFLT0_FLTB_SHIFT                   (2U)
/*! FLTB - Filter Selection for Input from PTB
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTB(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTB_SHIFT)) & PORT_IOFLT0_FLTB_MASK)
#define PORT_IOFLT0_FLTC_MASK                    (0x30U)
#define PORT_IOFLT0_FLTC_SHIFT                   (4U)
/*! FLTC - Filter Selection for Input from PTC
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTC(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTC_SHIFT)) & PORT_IOFLT0_FLTC_MASK)
#define PORT_IOFLT0_FLTD_MASK                    (0xC0U)
#define PORT_IOFLT0_FLTD_SHIFT                   (6U)
/*! FLTD - Filter Selection for Input from PTD
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTD(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTD_SHIFT)) & PORT_IOFLT0_FLTD_MASK)
#define PORT_IOFLT0_FLTE_MASK                    (0x300U)
#define PORT_IOFLT0_FLTE_SHIFT                   (8U)
/*! FLTE - Filter Selection for Input from PTD
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTE(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTE_SHIFT)) & PORT_IOFLT0_FLTE_MASK)
#define PORT_IOFLT0_FLTF_MASK                    (0xC00U)
#define PORT_IOFLT0_FLTF_SHIFT                   (10U)
/*! FLTF - Filter Selection for Input from PTF
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTF(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTF_SHIFT)) & PORT_IOFLT0_FLTF_MASK)
#define PORT_IOFLT0_FLTG_MASK                    (0x3000U)
#define PORT_IOFLT0_FLTG_SHIFT                   (12U)
/*! FLTG - Filter Selection for Input from PTG
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTG(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTG_SHIFT)) & PORT_IOFLT0_FLTG_MASK)
#define PORT_IOFLT0_FLTH_MASK                    (0xC000U)
#define PORT_IOFLT0_FLTH_SHIFT                   (14U)
/*! FLTH - Filter Selection for Input from PTH
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTH(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTH_SHIFT)) & PORT_IOFLT0_FLTH_MASK)
#define PORT_IOFLT0_FLTRST_MASK                  (0x30000U)
#define PORT_IOFLT0_FLTRST_SHIFT                 (16U)
/*! FLTRST - Filter Selection for Input from RESET/IRQ
 *  0b00..No filter.
 *  0b01..Selects FLTDIV1, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b10..Selects FLTDIV2, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTRST(x)                    (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTRST_SHIFT)) & PORT_IOFLT0_FLTRST_MASK)
#define PORT_IOFLT0_FLTKBI0_MASK                 (0xC0000U)
#define PORT_IOFLT0_FLTKBI0_SHIFT                (18U)
/*! FLTKBI0 - Filter selection for Input from KBI0
 *  0b00..No filter.
 *  0b01..Selects FLTDIV1, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b10..Selects FLTDIV2, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTKBI0(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTKBI0_SHIFT)) & PORT_IOFLT0_FLTKBI0_MASK)
#define PORT_IOFLT0_FLTKBI1_MASK                 (0x300000U)
#define PORT_IOFLT0_FLTKBI1_SHIFT                (20U)
/*! FLTKBI1 - Filter Selection for Input from KBI1
 *  0b00..No filter
 *  0b01..Selects FLTDIV1, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b10..Selects FLTDIV2, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTKBI1(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTKBI1_SHIFT)) & PORT_IOFLT0_FLTKBI1_MASK)
#define PORT_IOFLT0_FLTNMI_MASK                  (0xC00000U)
#define PORT_IOFLT0_FLTNMI_SHIFT                 (22U)
/*! FLTNMI - Filter Selection for Input from NMI
 *  0b00..No filter.
 *  0b01..Selects FLTDIV1, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b10..Selects FLTDIV2, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT0_FLTNMI(x)                    (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTNMI_SHIFT)) & PORT_IOFLT0_FLTNMI_MASK)
#define PORT_IOFLT0_FLTDIV1_MASK                 (0x3000000U)
#define PORT_IOFLT0_FLTDIV1_SHIFT                (24U)
/*! FLTDIV1 - Filter Division Set 1
 *  0b00..BUSCLK/2
 *  0b01..BUSCLK/4
 *  0b10..BUSCLK/8
 *  0b11..BUSCLK/16
 */
#define PORT_IOFLT0_FLTDIV1(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTDIV1_SHIFT)) & PORT_IOFLT0_FLTDIV1_MASK)
#define PORT_IOFLT0_FLTDIV2_MASK                 (0x1C000000U)
#define PORT_IOFLT0_FLTDIV2_SHIFT                (26U)
/*! FLTDIV2 - Filter Division Set 2
 *  0b000..BUSCLK/32
 *  0b001..BUSCLK/64
 *  0b010..BUSCLK/128
 *  0b011..BUSCLK/256
 *  0b100..BUSCLK/512
 *  0b101..BUSCLK/1024
 *  0b110..BUSCLK/2048
 *  0b111..BUSCLK/4096
 */
#define PORT_IOFLT0_FLTDIV2(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTDIV2_SHIFT)) & PORT_IOFLT0_FLTDIV2_MASK)
#define PORT_IOFLT0_FLTDIV3_MASK                 (0xE0000000U)
#define PORT_IOFLT0_FLTDIV3_SHIFT                (29U)
/*! FLTDIV3 - Filter Division Set 3
 *  0b000..LPOCLK
 *  0b001..LPOCLK/2
 *  0b010..LPOCLK/4
 *  0b011..LPOCLK/8
 *  0b100..LPOCLK/16
 *  0b101..LPOCLK/32
 *  0b110..LPOCLK/64
 *  0b111..LPOCLK/128
 */
#define PORT_IOFLT0_FLTDIV3(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT0_FLTDIV3_SHIFT)) & PORT_IOFLT0_FLTDIV3_MASK)
/*! @} */

/*! @name IOFLT1 - Port Filter Register 1 */
/*! @{ */
#define PORT_IOFLT1_FLTI_MASK                    (0x3U)
#define PORT_IOFLT1_FLTI_SHIFT                   (0U)
/*! FLTI - Filter Selection for Input from PTI
 *  0b00..BUSCLK
 *  0b01..FLTDIV1
 *  0b10..FLTDIV2
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT1_FLTI(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTI_SHIFT)) & PORT_IOFLT1_FLTI_MASK)
#define PORT_IOFLT1_FLTIRQ_MASK                  (0x30U)
#define PORT_IOFLT1_FLTIRQ_SHIFT                 (4U)
/*! FLTIRQ - Filter Selection for Input from IRQ
 *  0b00..No filter
 *  0b01..Selects FLTDIV1, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b10..Selects FLTDIV2, and will switch to FLTDIV3 in Stop mode automatically.
 *  0b11..FLTDIV3
 */
#define PORT_IOFLT1_FLTIRQ(x)                    (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTIRQ_SHIFT)) & PORT_IOFLT1_FLTIRQ_MASK)
#define PORT_IOFLT1_FLTFTM0_MASK                 (0xC0U)
#define PORT_IOFLT1_FLTFTM0_SHIFT                (6U)
/*! FLTFTM0 - Filter Selection For Input from FTM0CH0/FTM0CH1
 *  0b00..No filter
 *  0b01..Select FLTDIV1
 *  0b10..Select FLTDIV2
 *  0b11..Select FLTDIV3
 */
#define PORT_IOFLT1_FLTFTM0(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTFTM0_SHIFT)) & PORT_IOFLT1_FLTFTM0_MASK)
#define PORT_IOFLT1_FLTFTM1_MASK                 (0x300U)
#define PORT_IOFLT1_FLTFTM1_SHIFT                (8U)
/*! FLTFTM1 - Filter Selection For Input from FTM1CH0/FTM1CH1
 *  0b00..No filter
 *  0b01..Select FLTDIV1
 *  0b10..Select FLTDIV2
 *  0b11..Select FLTDIV3
 */
#define PORT_IOFLT1_FLTFTM1(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTFTM1_SHIFT)) & PORT_IOFLT1_FLTFTM1_MASK)
#define PORT_IOFLT1_FLTPWT_MASK                  (0xC00U)
#define PORT_IOFLT1_FLTPWT_SHIFT                 (10U)
/*! FLTPWT - Filter Selection For Input from PWT_IN1/PWT_IN0
 *  0b00..No filter
 *  0b01..Select FLTDIV1
 *  0b10..Select FLTDIV2
 *  0b11..Select FLTDIV3
 */
#define PORT_IOFLT1_FLTPWT(x)                    (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTPWT_SHIFT)) & PORT_IOFLT1_FLTPWT_MASK)
#define PORT_IOFLT1_FLTI2C0_MASK                 (0x3000U)
#define PORT_IOFLT1_FLTI2C0_SHIFT                (12U)
/*! FLTI2C0 - Filter Selection For Input from SCL0/SDA0
 *  0b00..No filter
 *  0b01..Select FLTDIV1
 *  0b10..Select FLTDIV2
 *  0b11..Select BUSCLK
 */
#define PORT_IOFLT1_FLTI2C0(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTI2C0_SHIFT)) & PORT_IOFLT1_FLTI2C0_MASK)
#define PORT_IOFLT1_FLTI2C1_MASK                 (0xC000U)
#define PORT_IOFLT1_FLTI2C1_SHIFT                (14U)
/*! FLTI2C1 - Filter Selection For Input from SCL1/SDA1
 *  0b00..No filter
 *  0b01..Select FLTDIV1
 *  0b10..Select FLTDIV2
 *  0b11..Select BUSCLK
 */
#define PORT_IOFLT1_FLTI2C1(x)                   (((uint32_t)(((uint32_t)(x)) << PORT_IOFLT1_FLTI2C1_SHIFT)) & PORT_IOFLT1_FLTI2C1_MASK)
/*! @} */

/*! @name PUE0 - Port Pullup Enable Register 0 */
/*! @{ */
#define PORT_PUE0_PTAPE0_MASK                    (0x1U)
#define PORT_PUE0_PTAPE0_SHIFT                   (0U)
/*! PTAPE0 - Pull Enable for Port A Bit 0
 *  0b0..Pullup is disabled for port A bit 0.
 *  0b1..Pullup is enabled for port A bit 0.
 */
#define PORT_PUE0_PTAPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE0_SHIFT)) & PORT_PUE0_PTAPE0_MASK)
#define PORT_PUE0_PTAPE1_MASK                    (0x2U)
#define PORT_PUE0_PTAPE1_SHIFT                   (1U)
/*! PTAPE1 - Pull Enable for Port A Bit 1
 *  0b0..Pullup is disabled for port A bit 1.
 *  0b1..Pullup is enabled for port A bit 1.
 */
#define PORT_PUE0_PTAPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE1_SHIFT)) & PORT_PUE0_PTAPE1_MASK)
#define PORT_PUE0_PTAPE2_MASK                    (0x4U)
#define PORT_PUE0_PTAPE2_SHIFT                   (2U)
/*! PTAPE2 - Pull Enable for Port A Bit 2
 *  0b0..Pullup is disabled for port A bit 2.
 *  0b1..Pullup is enabled for port A bit 2.
 */
#define PORT_PUE0_PTAPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE2_SHIFT)) & PORT_PUE0_PTAPE2_MASK)
#define PORT_PUE0_PTAPE3_MASK                    (0x8U)
#define PORT_PUE0_PTAPE3_SHIFT                   (3U)
/*! PTAPE3 - Pull Enable for Port A Bit 3
 *  0b0..Pullup is disabled for port A bit 3.
 *  0b1..Pullup is enabled for port A bit 3.
 */
#define PORT_PUE0_PTAPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE3_SHIFT)) & PORT_PUE0_PTAPE3_MASK)
#define PORT_PUE0_PTAPE4_MASK                    (0x10U)
#define PORT_PUE0_PTAPE4_SHIFT                   (4U)
/*! PTAPE4 - Pull Enable for Port A Bit 4
 *  0b0..Pullup is disabled for port A bit 4.
 *  0b1..Pullup is enabled for port A bit 4.
 */
#define PORT_PUE0_PTAPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE4_SHIFT)) & PORT_PUE0_PTAPE4_MASK)
#define PORT_PUE0_PTAPE5_MASK                    (0x20U)
#define PORT_PUE0_PTAPE5_SHIFT                   (5U)
/*! PTAPE5 - Pull Enable for Port A Bit 5
 *  0b0..Pullup is disabled for port A bit 5.
 *  0b1..Pullup is enabled for port A bit 5.
 */
#define PORT_PUE0_PTAPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE5_SHIFT)) & PORT_PUE0_PTAPE5_MASK)
#define PORT_PUE0_PTAPE6_MASK                    (0x40U)
#define PORT_PUE0_PTAPE6_SHIFT                   (6U)
/*! PTAPE6 - Pull Enable for Port A Bit 6
 *  0b0..Pullup is disabled for port A bit 6.
 *  0b1..Pullup is enabled for port A bit 6.
 */
#define PORT_PUE0_PTAPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE6_SHIFT)) & PORT_PUE0_PTAPE6_MASK)
#define PORT_PUE0_PTAPE7_MASK                    (0x80U)
#define PORT_PUE0_PTAPE7_SHIFT                   (7U)
/*! PTAPE7 - Pull Enable for Port A Bit 7
 *  0b0..Pullup is disabled for port A bit 7.
 *  0b1..Pullup is enabled for port A bit 7.
 */
#define PORT_PUE0_PTAPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTAPE7_SHIFT)) & PORT_PUE0_PTAPE7_MASK)
#define PORT_PUE0_PTBPE0_MASK                    (0x100U)
#define PORT_PUE0_PTBPE0_SHIFT                   (8U)
/*! PTBPE0 - Pull Enable for Port B Bit 0
 *  0b0..Pullup is disabled for port B bit 0.
 *  0b1..Pullup is enabled for port B bit 0.
 */
#define PORT_PUE0_PTBPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE0_SHIFT)) & PORT_PUE0_PTBPE0_MASK)
#define PORT_PUE0_PTBPE1_MASK                    (0x200U)
#define PORT_PUE0_PTBPE1_SHIFT                   (9U)
/*! PTBPE1 - Pull Enable for Port B Bit 1
 *  0b0..Pullup is disabled for port B bit 1.
 *  0b1..Pullup is enabled for port B bit 1.
 */
#define PORT_PUE0_PTBPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE1_SHIFT)) & PORT_PUE0_PTBPE1_MASK)
#define PORT_PUE0_PTBPE2_MASK                    (0x400U)
#define PORT_PUE0_PTBPE2_SHIFT                   (10U)
/*! PTBPE2 - Pull Enable for Port B Bit 2
 *  0b0..Pullup is disabled for port B bit 2.
 *  0b1..Pullup is enabled for port B bit 2.
 */
#define PORT_PUE0_PTBPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE2_SHIFT)) & PORT_PUE0_PTBPE2_MASK)
#define PORT_PUE0_PTBPE3_MASK                    (0x800U)
#define PORT_PUE0_PTBPE3_SHIFT                   (11U)
/*! PTBPE3 - Pull Enable for Port B Bit 3
 *  0b0..Pullup is disabled for port B bit 3.
 *  0b1..Pullup is enabled for port B bit 3.
 */
#define PORT_PUE0_PTBPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE3_SHIFT)) & PORT_PUE0_PTBPE3_MASK)
#define PORT_PUE0_PTBPE4_MASK                    (0x1000U)
#define PORT_PUE0_PTBPE4_SHIFT                   (12U)
/*! PTBPE4 - Pull Enable for Port B Bit 4
 *  0b0..Pullup is disabled for port B bit 4.
 *  0b1..Pullup is enabled for port B bit 4.
 */
#define PORT_PUE0_PTBPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE4_SHIFT)) & PORT_PUE0_PTBPE4_MASK)
#define PORT_PUE0_PTBPE5_MASK                    (0x2000U)
#define PORT_PUE0_PTBPE5_SHIFT                   (13U)
/*! PTBPE5 - Pull Enable for Port B Bit 5
 *  0b0..Pullup is disabled for port B bit 5.
 *  0b1..Pullup is enabled for port B bit 5.
 */
#define PORT_PUE0_PTBPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE5_SHIFT)) & PORT_PUE0_PTBPE5_MASK)
#define PORT_PUE0_PTBPE6_MASK                    (0x4000U)
#define PORT_PUE0_PTBPE6_SHIFT                   (14U)
/*! PTBPE6 - Pull Enable for Port B Bit 6
 *  0b0..Pullup is disabled for port B bit 6.
 *  0b1..Pullup is enabled for port B bit 6.
 */
#define PORT_PUE0_PTBPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE6_SHIFT)) & PORT_PUE0_PTBPE6_MASK)
#define PORT_PUE0_PTBPE7_MASK                    (0x8000U)
#define PORT_PUE0_PTBPE7_SHIFT                   (15U)
/*! PTBPE7 - Pull Enable for Port B Bit 7
 *  0b0..Pullup is disabled for port B bit 7.
 *  0b1..Pullup is enabled for port B bit 7.
 */
#define PORT_PUE0_PTBPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTBPE7_SHIFT)) & PORT_PUE0_PTBPE7_MASK)
#define PORT_PUE0_PTCPE0_MASK                    (0x10000U)
#define PORT_PUE0_PTCPE0_SHIFT                   (16U)
/*! PTCPE0 - Pull Enable for Port C Bit 0
 *  0b0..Pullup is disabled for port C bit 0.
 *  0b1..Pullup is enabled for port C bit 0.
 */
#define PORT_PUE0_PTCPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE0_SHIFT)) & PORT_PUE0_PTCPE0_MASK)
#define PORT_PUE0_PTCPE1_MASK                    (0x20000U)
#define PORT_PUE0_PTCPE1_SHIFT                   (17U)
/*! PTCPE1 - Pull Enable for Port C Bit 1
 *  0b0..Pullup is disabled for port C bit 1.
 *  0b1..Pullup is enabled for port C bit 1.
 */
#define PORT_PUE0_PTCPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE1_SHIFT)) & PORT_PUE0_PTCPE1_MASK)
#define PORT_PUE0_PTCPE2_MASK                    (0x40000U)
#define PORT_PUE0_PTCPE2_SHIFT                   (18U)
/*! PTCPE2 - Pull Enable for Port C Bit 2
 *  0b0..Pullup is disabled for port C bit 2.
 *  0b1..Pullup is enabled for port C bit 2.
 */
#define PORT_PUE0_PTCPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE2_SHIFT)) & PORT_PUE0_PTCPE2_MASK)
#define PORT_PUE0_PTCPE3_MASK                    (0x80000U)
#define PORT_PUE0_PTCPE3_SHIFT                   (19U)
/*! PTCPE3 - Pull Enable for Port C Bit 3
 *  0b0..Pullup is disabled for port C bit 3.
 *  0b1..Pullup is enabled for port C bit 3.
 */
#define PORT_PUE0_PTCPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE3_SHIFT)) & PORT_PUE0_PTCPE3_MASK)
#define PORT_PUE0_PTCPE4_MASK                    (0x100000U)
#define PORT_PUE0_PTCPE4_SHIFT                   (20U)
/*! PTCPE4 - Pull Enable for Port C Bit 4
 *  0b0..Pullup is disabled for port C bit 4.
 *  0b1..Pullup is enabled for port C bit 4.
 */
#define PORT_PUE0_PTCPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE4_SHIFT)) & PORT_PUE0_PTCPE4_MASK)
#define PORT_PUE0_PTCPE5_MASK                    (0x200000U)
#define PORT_PUE0_PTCPE5_SHIFT                   (21U)
/*! PTCPE5 - Pull Enable for Port C Bit 5
 *  0b0..Pullup is disabled for port C bit 5.
 *  0b1..Pullup is enabled for port C bit 5.
 */
#define PORT_PUE0_PTCPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE5_SHIFT)) & PORT_PUE0_PTCPE5_MASK)
#define PORT_PUE0_PTCPE6_MASK                    (0x400000U)
#define PORT_PUE0_PTCPE6_SHIFT                   (22U)
/*! PTCPE6 - Pull Enable for Port C Bit 6
 *  0b0..Pullup is disabled for port C bit 6.
 *  0b1..Pullup is enabled for port C bit 6.
 */
#define PORT_PUE0_PTCPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE6_SHIFT)) & PORT_PUE0_PTCPE6_MASK)
#define PORT_PUE0_PTCPE7_MASK                    (0x800000U)
#define PORT_PUE0_PTCPE7_SHIFT                   (23U)
/*! PTCPE7 - Pull Enable for Port C Bit 7
 *  0b0..Pullup is disabled for port C bit 7.
 *  0b1..Pullup is enabled for port C bit 7.
 */
#define PORT_PUE0_PTCPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTCPE7_SHIFT)) & PORT_PUE0_PTCPE7_MASK)
#define PORT_PUE0_PTDPE0_MASK                    (0x1000000U)
#define PORT_PUE0_PTDPE0_SHIFT                   (24U)
/*! PTDPE0 - Pull Enable for Port D Bit 0
 *  0b0..Pullup is disabled for port D bit 0.
 *  0b1..Pullup is enabled for port D bit 0.
 */
#define PORT_PUE0_PTDPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE0_SHIFT)) & PORT_PUE0_PTDPE0_MASK)
#define PORT_PUE0_PTDPE1_MASK                    (0x2000000U)
#define PORT_PUE0_PTDPE1_SHIFT                   (25U)
/*! PTDPE1 - Pull Enable for Port D Bit 1
 *  0b0..Pullup is disabled for port D bit 1.
 *  0b1..Pullup is enabled for port D bit 1.
 */
#define PORT_PUE0_PTDPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE1_SHIFT)) & PORT_PUE0_PTDPE1_MASK)
#define PORT_PUE0_PTDPE2_MASK                    (0x4000000U)
#define PORT_PUE0_PTDPE2_SHIFT                   (26U)
/*! PTDPE2 - Pull Enable for Port D Bit 2
 *  0b0..Pullup is disabled for port D bit 2.
 *  0b1..Pullup is enabled for port D bit 2.
 */
#define PORT_PUE0_PTDPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE2_SHIFT)) & PORT_PUE0_PTDPE2_MASK)
#define PORT_PUE0_PTDPE3_MASK                    (0x8000000U)
#define PORT_PUE0_PTDPE3_SHIFT                   (27U)
/*! PTDPE3 - Pull Enable for Port D Bit 3
 *  0b0..Pullup is disabled for port D bit 3.
 *  0b1..Pullup is enabled for port D bit 3.
 */
#define PORT_PUE0_PTDPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE3_SHIFT)) & PORT_PUE0_PTDPE3_MASK)
#define PORT_PUE0_PTDPE4_MASK                    (0x10000000U)
#define PORT_PUE0_PTDPE4_SHIFT                   (28U)
/*! PTDPE4 - Pull Enable for Port D Bit 4
 *  0b0..Pullup is disabled for port D bit 4.
 *  0b1..Pullup is enabled for port D bit 4.
 */
#define PORT_PUE0_PTDPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE4_SHIFT)) & PORT_PUE0_PTDPE4_MASK)
#define PORT_PUE0_PTDPE5_MASK                    (0x20000000U)
#define PORT_PUE0_PTDPE5_SHIFT                   (29U)
/*! PTDPE5 - Pull Enable for Port D Bit 5
 *  0b0..Pullup is disabled for port D bit 5.
 *  0b1..Pullup is enabled for port D bit 5.
 */
#define PORT_PUE0_PTDPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE5_SHIFT)) & PORT_PUE0_PTDPE5_MASK)
#define PORT_PUE0_PTDPE6_MASK                    (0x40000000U)
#define PORT_PUE0_PTDPE6_SHIFT                   (30U)
/*! PTDPE6 - Pull Enable for Port D Bit 6
 *  0b0..Pullup is disabled for port D bit 6.
 *  0b1..Pullup is enabled for port D bit 6.
 */
#define PORT_PUE0_PTDPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE6_SHIFT)) & PORT_PUE0_PTDPE6_MASK)
#define PORT_PUE0_PTDPE7_MASK                    (0x80000000U)
#define PORT_PUE0_PTDPE7_SHIFT                   (31U)
/*! PTDPE7 - Pull Enable for Port D Bit 7
 *  0b0..Pullup is disabled for port D bit 7.
 *  0b1..Pullup is enabled for port D bit 7.
 */
#define PORT_PUE0_PTDPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUE0_PTDPE7_SHIFT)) & PORT_PUE0_PTDPE7_MASK)
/*! @} */

