MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKE06Z64VQH4/mcu.h
/*! @name PINSEL1 - Pin Selection Register 1 */
/*! @{ */
#define SIM_PINSEL1_FTM2PS0_MASK                 (0x3U)
#define SIM_PINSEL1_FTM2PS0_SHIFT                (0U)
/*! FTM2PS0 - FTM2 Channel 0 Pin Select
 *  0b00..FTM2 CH0 mapped on PTC0.
 *  0b01..FTM2 CH0 mapped on PTH0.
 *  0b10..FTM2 CH0 mapped on PTF0.
 *  0b11..Reserved.
 */
#define SIM_PINSEL1_FTM2PS0(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_FTM2PS0_SHIFT)) & SIM_PINSEL1_FTM2PS0_MASK)
#define SIM_PINSEL1_FTM2PS1_MASK                 (0xCU)
#define SIM_PINSEL1_FTM2PS1_SHIFT                (2U)
/*! FTM2PS1 - FTM2 Channel 1 Pin Select
 *  0b00..FTM2 CH1 mapped on PTC1.
 *  0b01..FTM2 CH1 mapped on PTH1.
 *  0b10..FTM2 CH1 mapped on PTF1.
 *  0b11..Reserved.
 */
#define SIM_PINSEL1_FTM2PS1(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_FTM2PS1_SHIFT)) & SIM_PINSEL1_FTM2PS1_MASK)
#define SIM_PINSEL1_FTM2PS2_MASK                 (0x30U)
#define SIM_PINSEL1_FTM2PS2_SHIFT                (4U)
/*! FTM2PS2 - FTM2 Channel 2 Pin Select
 *  0b00..FTM2 CH2 mapped on PTC2.
 *  0b01..FTM2 CH2 mapped on PTD0.
 *  0b10..FTM2 CH2 mapped on PTG4.
 *  0b11..Reserved.
 */
#define SIM_PINSEL1_FTM2PS2(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_FTM2PS2_SHIFT)) & SIM_PINSEL1_FTM2PS2_MASK)
#define SIM_PINSEL1_FTM2PS3_MASK                 (0xC0U)
#define SIM_PINSEL1_FTM2PS3_SHIFT                (6U)
/*! FTM2PS3 - FTM2 Channel 3 Pin Select
 *  0b00..FTM2 CH3 mapped on PTC3.
 *  0b01..FTM2 CH3 mapped on PTD1.
 *  0b10..FTM2 CH3 mapped on PTG5.
 *  0b11..Reserved.
 */
#define SIM_PINSEL1_FTM2PS3(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_FTM2PS3_SHIFT)) & SIM_PINSEL1_FTM2PS3_MASK)
#define SIM_PINSEL1_FTM2PS4_MASK                 (0x100U)
#define SIM_PINSEL1_FTM2PS4_SHIFT                (8U)
/*! FTM2PS4 - FTM2 Channel4 Pin Select
 *  0b0..FTM2 CH4 mapped on PTB4.
 *  0b1..FTM2 CH4 mapped on PTG6.
 */
#define SIM_PINSEL1_FTM2PS4(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_FTM2PS4_SHIFT)) & SIM_PINSEL1_FTM2PS4_MASK)
#define SIM_PINSEL1_FTM2PS5_MASK                 (0x200U)
#define SIM_PINSEL1_FTM2PS5_SHIFT                (9U)
/*! FTM2PS5 - FTM2 Channel 5 Pin Select
 *  0b0..FTM2 CH5 mapped on PTB5.
 *  0b1..FTM2 CH5 mapped on PTG7.
 */
#define SIM_PINSEL1_FTM2PS5(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_FTM2PS5_SHIFT)) & SIM_PINSEL1_FTM2PS5_MASK)
#define SIM_PINSEL1_I2C1PS_MASK                  (0x400U)
#define SIM_PINSEL1_I2C1PS_SHIFT                 (10U)
/*! I2C1PS - I2C1 Pin Select
 *  0b0..I2C1_SCL on PTE1, I2C1_SDA on PTE0.
 *  0b1..I2C1_SCL on PTH4, I2C1_SDA on PTH3.
 */
#define SIM_PINSEL1_I2C1PS(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_I2C1PS_SHIFT)) & SIM_PINSEL1_I2C1PS_MASK)
#define SIM_PINSEL1_SPI1PS_MASK                  (0x800U)
#define SIM_PINSEL1_SPI1PS_SHIFT                 (11U)
/*! SPI1PS - SPI1 Pin Select
 *  0b0..SPI1_SCK, SPI1_MOSI, SPI1_MISO, and SPI1_PCS are mapped on PTD0, PTD1, PTD2, and PTD3.
 *  0b1..SPI1_SCK, SPI1_MOSI, SPI1_MISO, and SPI1_PCS are mapped on PTG4, PTG5, PTG6, and PTG7.
 */
#define SIM_PINSEL1_SPI1PS(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_SPI1PS_SHIFT)) & SIM_PINSEL1_SPI1PS_MASK)
#define SIM_PINSEL1_UART1PS_MASK                 (0x1000U)
#define SIM_PINSEL1_UART1PS_SHIFT                (12U)
/*! UART1PS - UART1 Pin Select
 *  0b0..UART1_TX on PTC7, UART1_RX on PTC6.
 *  0b1..UART1_TX on PTF3, UART1_RX on PTF2.
 */
#define SIM_PINSEL1_UART1PS(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_UART1PS_SHIFT)) & SIM_PINSEL1_UART1PS_MASK)
#define SIM_PINSEL1_UART2PS_MASK                 (0x2000U)
#define SIM_PINSEL1_UART2PS_SHIFT                (13U)
/*! UART2PS - UART2 Pin Select
 *  0b0..UART2_TX on PTD7, UART2_RX on PTD6.
 *  0b1..UART2_TX on PTI1, UART2_RX on PTI0.
 */
#define SIM_PINSEL1_UART2PS(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_UART2PS_SHIFT)) & SIM_PINSEL1_UART2PS_MASK)
#define SIM_PINSEL1_PWTIN0PS_MASK                (0x4000U)
#define SIM_PINSEL1_PWTIN0PS_SHIFT               (14U)
/*! PWTIN0PS - PWTIN0 Pin Select
 *  0b0..PWTIN0 on PTD5.
 *  0b1..PWTIN0 on PTE2.
 */
#define SIM_PINSEL1_PWTIN0PS(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_PWTIN0PS_SHIFT)) & SIM_PINSEL1_PWTIN0PS_MASK)
#define SIM_PINSEL1_PWTIN1PS_MASK                (0x8000U)
#define SIM_PINSEL1_PWTIN1PS_SHIFT               (15U)
/*! PWTIN1PS - PWTIN1 Pin Select
 *  0b0..PWTIN1 on PTB0.
 *  0b1..PWTIN1 on PTH7.
 */
#define SIM_PINSEL1_PWTIN1PS(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_PWTIN1PS_SHIFT)) & SIM_PINSEL1_PWTIN1PS_MASK)
#define SIM_PINSEL1_MSCANPS_MASK                 (0x10000U)
#define SIM_PINSEL1_MSCANPS_SHIFT                (16U)
/*! MSCANPS - MSCAN Pin Select
 *  0b0..CAN_TX on PTC7, CAN_RX on PTC6.
 *  0b1..CAN_TX on PTE7, CAN_RX on PTH2.
 */
#define SIM_PINSEL1_MSCANPS(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_PINSEL1_MSCANPS_SHIFT)) & SIM_PINSEL1_MSCANPS_MASK)
/*! @} */

/*! @name SCGC - System Clock Gating Control Register */
/*! @{ */
#define SIM_SCGC_RTC_MASK                        (0x1U)
#define SIM_SCGC_RTC_SHIFT                       (0U)
/*! RTC - RTC Clock Gate Control
 *  0b0..Bus clock to the RTC module is disabled.
 *  0b1..Bus clock to the RTC module is enabled.
 */
#define SIM_SCGC_RTC(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_RTC_SHIFT)) & SIM_SCGC_RTC_MASK)
#define SIM_SCGC_PIT_MASK                        (0x2U)
#define SIM_SCGC_PIT_SHIFT                       (1U)
/*! PIT - PIT Clock Gate Control
 *  0b0..Bus clock to the PIT module is disabled.
 *  0b1..Bus clock to the PIT module is enabled.
 */
#define SIM_SCGC_PIT(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_PIT_SHIFT)) & SIM_SCGC_PIT_MASK)
#define SIM_SCGC_PWT_MASK                        (0x10U)
#define SIM_SCGC_PWT_SHIFT                       (4U)
/*! PWT - PWT Clock Gate Control
 *  0b0..Timer clock to the PWT module is disabled.
 *  0b1..Timer clock to the PWT module is enabled.
 */
#define SIM_SCGC_PWT(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_PWT_SHIFT)) & SIM_SCGC_PWT_MASK)
#define SIM_SCGC_FTM0_MASK                       (0x20U)
#define SIM_SCGC_FTM0_SHIFT                      (5U)
/*! FTM0 - FTM0 Clock Gate Control
 *  0b0..Bus clock to the FTM0 module is disabled.
 *  0b1..Bus clock to the FTM0 module is enabled.
 */
#define SIM_SCGC_FTM0(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_FTM0_SHIFT)) & SIM_SCGC_FTM0_MASK)
#define SIM_SCGC_FTM1_MASK                       (0x40U)
#define SIM_SCGC_FTM1_SHIFT                      (6U)
/*! FTM1 - FTM1 Clock Gate Control
 *  0b0..Bus clock to the FTM1 module is disabled.
 *  0b1..Bus clock to the FTM1 module is enabled.
 */
#define SIM_SCGC_FTM1(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_FTM1_SHIFT)) & SIM_SCGC_FTM1_MASK)
#define SIM_SCGC_FTM2_MASK                       (0x80U)
#define SIM_SCGC_FTM2_SHIFT                      (7U)
/*! FTM2 - FTM2 Clock Gate Control
 *  0b0..Bus clock to the FTM2 module is disabled.
 *  0b1..Bus clock to the FTM2 module is enabled.
 */
#define SIM_SCGC_FTM2(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_FTM2_SHIFT)) & SIM_SCGC_FTM2_MASK)
#define SIM_SCGC_CRC_MASK                        (0x400U)
#define SIM_SCGC_CRC_SHIFT                       (10U)
/*! CRC - CRC Clock Gate Control
 *  0b0..Bus clock to the CRC module is disabled.
 *  0b1..Bus clock to the CRC module is enabled.
 */
#define SIM_SCGC_CRC(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_CRC_SHIFT)) & SIM_SCGC_CRC_MASK)
#define SIM_SCGC_FLASH_MASK                      (0x1000U)
#define SIM_SCGC_FLASH_SHIFT                     (12U)
/*! FLASH - Flash Clock Gate Control
 *  0b0..Bus clock to the flash module is disabled.
 *  0b1..Bus clock to the flash module is enabled.
 */
#define SIM_SCGC_FLASH(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_FLASH_SHIFT)) & SIM_SCGC_FLASH_MASK)
#define SIM_SCGC_SWD_MASK                        (0x2000U)
#define SIM_SCGC_SWD_SHIFT                       (13U)
/*! SWD - SWD (single wire debugger) Clock Gate Control
 *  0b0..Bus clock to the SWD module is disabled.
 *  0b1..Bus clock to the SWD module is enabled.
 */
#define SIM_SCGC_SWD(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_SWD_SHIFT)) & SIM_SCGC_SWD_MASK)
#define SIM_SCGC_MSCAN_MASK                      (0x8000U)
#define SIM_SCGC_MSCAN_SHIFT                     (15U)
/*! MSCAN - MSCAN Clock Gate Control
 *  0b0..Bus clock to the MSCAN module is disabled.
 *  0b1..Bus clock to the MSCAN module is enabled.
 */
#define SIM_SCGC_MSCAN(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_MSCAN_SHIFT)) & SIM_SCGC_MSCAN_MASK)
#define SIM_SCGC_I2C0_MASK                       (0x10000U)
#define SIM_SCGC_I2C0_SHIFT                      (16U)
/*! I2C0 - I2C0 Clock Gate Control
 *  0b0..Bus clock to the I2C0 module is disabled.
 *  0b1..Bus clock to the I2C0 module is enabled.
 */
#define SIM_SCGC_I2C0(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_I2C0_SHIFT)) & SIM_SCGC_I2C0_MASK)
#define SIM_SCGC_I2C1_MASK                       (0x20000U)
#define SIM_SCGC_I2C1_SHIFT                      (17U)
/*! I2C1 - I2C1 Clock Gate Control
 *  0b0..Bus clock to the I2C1 module is disabled.
 *  0b1..Bus clock to the I2C1 module is enabled.
 */
#define SIM_SCGC_I2C1(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_I2C1_SHIFT)) & SIM_SCGC_I2C1_MASK)
#define SIM_SCGC_SPI0_MASK                       (0x40000U)
#define SIM_SCGC_SPI0_SHIFT                      (18U)
/*! SPI0 - SPI0 Clock Gate Control
 *  0b0..Bus clock to the SPI0 module is disabled.
 *  0b1..Bus clock to the SPI0 module is enabled.
 */
#define SIM_SCGC_SPI0(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_SPI0_SHIFT)) & SIM_SCGC_SPI0_MASK)
#define SIM_SCGC_SPI1_MASK                       (0x80000U)
#define SIM_SCGC_SPI1_SHIFT                      (19U)
/*! SPI1 - SPI1 Clock Gate Control
 *  0b0..Bus clock to the SPI1 module is disabled.
 *  0b1..Bus clock to the SPI1 module is enabled.
 */
#define SIM_SCGC_SPI1(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_SPI1_SHIFT)) & SIM_SCGC_SPI1_MASK)
#define SIM_SCGC_UART0_MASK                      (0x100000U)
#define SIM_SCGC_UART0_SHIFT                     (20U)
/*! UART0 - UART0 Clock Gate Control
 *  0b0..Bus clock to the UART0 module is disabled.
 *  0b1..Bus clock to the UART0 module is enabled.
 */
#define SIM_SCGC_UART0(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_UART0_SHIFT)) & SIM_SCGC_UART0_MASK)
#define SIM_SCGC_UART1_MASK                      (0x200000U)
#define SIM_SCGC_UART1_SHIFT                     (21U)
/*! UART1 - UART1 Clock Gate Control
 *  0b0..Bus clock to the UART1 module is disabled.
 *  0b1..Bus clock to the UART1 module is enabled.
 */
#define SIM_SCGC_UART1(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_UART1_SHIFT)) & SIM_SCGC_UART1_MASK)
#define SIM_SCGC_UART2_MASK                      (0x400000U)
#define SIM_SCGC_UART2_SHIFT                     (22U)
/*! UART2 - UART2 Clock Gate Control
 *  0b0..Bus clock to the UART2 module is disabled.
 *  0b1..Bus clock to the UART2 module is enabled.
 */
#define SIM_SCGC_UART2(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_UART2_SHIFT)) & SIM_SCGC_UART2_MASK)
#define SIM_SCGC_KBI0_MASK                       (0x1000000U)
#define SIM_SCGC_KBI0_SHIFT                      (24U)
/*! KBI0 - KBI0 Clock Gate Control
 *  0b0..Bus clock to the KBI0 module is disabled.
 *  0b1..Bus clock to the KBI0 module is enabled.
 */
#define SIM_SCGC_KBI0(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_KBI0_SHIFT)) & SIM_SCGC_KBI0_MASK)
#define SIM_SCGC_KBI1_MASK                       (0x2000000U)
#define SIM_SCGC_KBI1_SHIFT                      (25U)
/*! KBI1 - KBI1 Clock Gate Control
 *  0b0..Bus clock to the KBI1 module is disabled.
 *  0b1..Bus clock to the KBI1 module is enabled.
 */
#define SIM_SCGC_KBI1(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_KBI1_SHIFT)) & SIM_SCGC_KBI1_MASK)
#define SIM_SCGC_IRQ_MASK                        (0x8000000U)
#define SIM_SCGC_IRQ_SHIFT                       (27U)
/*! IRQ - IRQ Clock Gate Control
 *  0b0..Bus clock to the IRQ module is disabled.
 *  0b1..Bus clock to the IRQ module is enabled.
 */
#define SIM_SCGC_IRQ(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_IRQ_SHIFT)) & SIM_SCGC_IRQ_MASK)
#define SIM_SCGC_ADC_MASK                        (0x20000000U)
#define SIM_SCGC_ADC_SHIFT                       (29U)
/*! ADC - ADC Clock Gate Control
 *  0b0..Bus clock to the ADC module is disabled.
 *  0b1..Bus clock to the ADC module is enabled.
 */
#define SIM_SCGC_ADC(x)                          (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_ADC_SHIFT)) & SIM_SCGC_ADC_MASK)
#define SIM_SCGC_ACMP0_MASK                      (0x40000000U)
#define SIM_SCGC_ACMP0_SHIFT                     (30U)
/*! ACMP0 - ACMP0 Clock Gate Control
 *  0b0..Bus clock to the ACMP0 module is disabled.
 *  0b1..Bus clock to the ACMP0 module is enabled.
 */
#define SIM_SCGC_ACMP0(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_ACMP0_SHIFT)) & SIM_SCGC_ACMP0_MASK)
#define SIM_SCGC_ACMP1_MASK                      (0x80000000U)
#define SIM_SCGC_ACMP1_SHIFT                     (31U)
/*! ACMP1 - ACMP1 Clock Gate Control
 *  0b0..Bus clock to the ACMP1 module is disabled.
 *  0b1..Bus clock to the ACMP1 module is enabled.
 */
#define SIM_SCGC_ACMP1(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC_ACMP1_SHIFT)) & SIM_SCGC_ACMP1_MASK)
/*! @} */

